{
  "manifest": {
    "publishingInformation": {
      "locales": {
        "pt-BR": {
          "summary": "Ajudar estudantes em Genética de Populações, nas disciplinas ofertadas na graduação, assim como em Programas de Pós-Graduação (Biologia Ambiental / Zoologia).",
          "examplePhrases": [
            "Alexa, abrir Professor de Evolução",
            "Alexa, pergunte ao Professor de Evolução qual a primeira Lei de Mendel",
            "Alexa, pergunte ao Professor de Evolução o que é o equilíbrio de Hardy e Weinberg"
          ],
          "keywords": [
            "Evolution"
          ],
          "name": "Genética de Populações",
          "description": "Este skill foi criado pelo Aluno de doutorado do PPBA, M.Sc. Luan Rabelo, e pelo Prof. Dr. Marcelo Vallinoto, e Prof. Dr. Davidson Sodré, para auxiliar os alunos que participam das aulas que ministramos na Universidade Federal do Pará (UFPA) e Universidade Rural da Amazônia (UFRA). No entanto, vale ressaltar que este exemplo de Skill pode (e deve) ser realizado por outros professores, podendo incluir somente uma disciplina ou conjunto de disciplinas ofertadas em cursos de Universidade, ou mesmo escolas.\nEsta Skill contém apenas as aulas de Genética de Populações, as quais um dos autores (Prof. Dr. Marcelo Vallinoto) ministra na UFPA. O objetivo disto é criar condições para que, após as aulas, os usuários (alunos ou não), possam ter acesso a conteúdo explicativos de cada uma das aulas de uma determinada disciplina. Assim, eles poderão ter acesso as ementas, planos de aulas de cada aula ministrada ou conteúdo resumido em forma de esquemas, de uma aula escolhida, e finalmente explicações dos principais pontos abordados na sala de aula para um tema específico, contribuindo para a sedimentação do conhecimento abordado em classe.\nO intuito do skill é fornecer aos alunos, e principalmente durante a pandemia, uma forma de diálogo artificial com o professor, além de poder mandar (futuramente) perguntas através do skill ao professor e ter retorno delas.\nPor fim, este aplicativo também é apropriado para alunos com necessidades especiais, com alguma deficiência visual, assessorando em seus estudos domésticos e ajudando-os a tirar dúvidas com o professor. Essa Skill usada juntamente com funções nativas da Alexa, como criação de listas de tarefas de calendário, entre outras, torna essa ferramenta mais inclusiva.\nAo abrir o Skill, a Alexa dará as boas-vindas a disciplina e fornecerá alguns exemplos de perguntas. Por exemplo, após entrar na disciplina, o usuário poderá perguntar “Alexa, qual a ementa da disciplina?” ou ainda, posteriormente, de preferência, “Alexa, quais as aulas ministradas na disciplina?”. \nAs aulas serão ordenadas em números, como Aula 2, seguida do nome da mesma (Exemplo, Aula 2 – Equilíbrio de Hardy-Weinberg). Sendo assim, para saber o conteúdo da mesma, o usuário poderá perguntar “Alexa, qual o conteúdo da aula 2 – Equilíbrio de Hardy-Weinberg” ou “Alexa, qual o conteúdo da aula 2?” ou ainda “Alexa, qual o conteúdo da aula Equilíbrio de Hardy-Weinberg”. \nCada a aula é dividida em tópicos, assim, tendo conhecimento prévio do conteúdo (tópicos) de uma aula específica, o usuário poderá perguntar sobre os assuntos abordados dentro deste tópico escolhido. No entanto, devido à complexidade das perguntas, o usuário pode perguntar a Alexa sobre potenciais perguntas de uma dada aula ou assunto, e assim, ela selecionará algumas ao acaso (isto visa principalmente aos alunos com deficiência visual).\nDa mesma forma, todas as potencias perguntas podem ser acessadas em nosso site: www.rhinellalab.com/perguntasAI.\nPara facilitar, adotamos o seguinte esquema: após ligar a Alexa (por exemplo em seu celular) e clicar no ícone para falar, para que o usuário entre diretamente numa pergunta, basta dizer Pergunte ao Professor De Evolução, seguido da pergunta a ser feita, que automaticamente ela responderá. \nExemplo. Se você desejar perguntar, O que é o equilíbrio de Hardy e Weinberg? Então, bastará perguntar, “Alexa, pergunte ao professor de evolução, o que é o equilíbrio de Hardy e Weinberg?\nNote, as perguntas devem ser feitas de forma clara. Qualquer interrupção, ou palavras erradas, ela não conseguirá responder, ou então poderá fornecer respostas erradas. Da mesma forma, palavras em inglês, nomes de pessoas, ou ainda expressões que não são traduzidas (ex: stepping-stone; ou modelo Wright-Fisher) foram aportuguesadas e podem ser encontradas nas perguntas no site.\n\nO conteúdo da habilidade está em Portugês\nA habilidade tem algum conteúdo em inglês\nThe skill has some content in English",
          "smallIconUri": "file://assets/images/pt-BR_smallIconUri.png",
          "updatesDescription": "Esta é a primeira versão do Skill, sendo assim, após a aplicação desta para os alunos, mudanças serão feiras para melhorar o skill, principalmente quanto pergunta/resposta.",
          "largeIconUri": "file://assets/images/pt-BR_largeIconUri.png"
        }
      },
      "automaticDistribution": {
        "isActive": false
      },
      "isAvailableWorldwide": true,
      "testingInstructions": "Internet Connection",
      "category": "EDUCATION_AND_REFERENCE",
      "distributionMode": "PUBLIC",
      "distributionCountries": []
    },
    "apis": {
      "custom": {
        "endpoint": {
          "uri": "arn:aws:lambda:us-east-1:940294169848:function:5afc1045-b2d0-4c7b-be9f-6a7333e156c1:Release_0"
        },
        "interfaces": [],
        "regions": {
          "EU": {
            "endpoint": {
              "uri": "arn:aws:lambda:eu-west-1:940294169848:function:5afc1045-b2d0-4c7b-be9f-6a7333e156c1:Release_0"
            }
          },
          "NA": {
            "endpoint": {
              "uri": "arn:aws:lambda:us-east-1:940294169848:function:5afc1045-b2d0-4c7b-be9f-6a7333e156c1:Release_0"
            }
          },
          "FE": {
            "endpoint": {
              "uri": "arn:aws:lambda:us-west-2:940294169848:function:5afc1045-b2d0-4c7b-be9f-6a7333e156c1:Release_0"
            }
          }
        }
      }
    },
    "manifestVersion": "1.0",
    "permissions": [],
    "privacyAndCompliance": {
      "allowsPurchases": false,
      "locales": {
        "pt-BR": {}
      },
      "containsAds": false,
      "isExportCompliant": true,
      "isChildDirected": false,
      "usesPersonalInfo": false
    }
  }
}